#include <stdio.h>


const int N = 1e5 + 10;  const int M = 1e6 + 10;
int n, m;
char p[N], s[M];

int nxt[N];

int main() {
    // 字符串从1开始
    scanf("%d", &n); scanf("%s", p + 1);
    scanf("%d", &m); scanf("%s", s + 1);
    
    // 2 求解nxt数组的过程
    // 只需要在模式串中处理，i从2开始，因为P[1] = 0;
    // 意味着模式串第一个字符不匹配，那么退无可退，下一次
    // 仍然要从1开始匹配
    // i是先锋，最终i的结果满足
    // P[1, j] == P[i - j + 1]
    for(int i = 2, j = 0; i <= n; i++) {
        while(j && p[i] != p[j + 1]) {
            j = nxt[j];
        }
        if(p[i] == p[j + 1]) j ++;
        nxt[i] = j;
    }
    // 我们可以借鉴1的过程理解2
    // 实际就是P的前段与后段进行字符串匹配
    
    
    
    // 1 KMP的匹配过程
    // 我们是S[i]与P[j + 1]匹配，所以j从0开始
    // 这里是为了简化操作，j从0开始，j=0就代表已经到头了
    // 下一步i与j+1匹配，对应两个串是i和1匹配，从头开始
    // 0相当于一个哨兵，提示我们的模式串要从头开始了
    for(int i = 1, j = 0; i <= m; i ++) {
        while(j && s[i] != p[j + 1]) {
            j = nxt[j];
        } // 循环结束有两种可能
        // 1 j退到开头0，不处理，等i++
        // 2 S[i] P[j + 1]匹配，i++，j也要++
        if(s[i] == p[j + 1]) j ++;
        if(j == n) {
            // 匹配成功
            printf("%d ", i - n);
            // 因为最终结果要从0开始，所以 - 1变为i - n
            j = nxt[j];
            // 匹配完成后，j也要回退一次，继续匹配
        }
    }
    
    return 0;
}


